DataProcessors/ЗагрузкаДанныхИзAccess.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхИзAccess</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьСведенияОРазмещеннойРекламе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеЛистовУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОКоличествеПродавцовНаТочках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОТорговыхТочках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОСкладах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОГруппахТорговыхТочек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОбращенийКПокупателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОМаржинальностиТорговыхТочек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПромоакциях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОбОбученииПродавцов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПродавцах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПотерянныхПродажах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеПоступлений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПривязкеКладовщиковКСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеПеремещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОЦенахПродажиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеБланков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПорядкеОбеспеченияТорговыхТочек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОЗаказеИПоставкеТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОбУсловияхПоставкиТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОЗаказахПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПараметрахЗагрузкиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОТоварныхОграниченияхНаТорговыхТочках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОГрафикеРазвозаТовараПоТочкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОбОрганизацииПолучателеТовараНаТочку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьНачальныеДанныеОЦенахПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОЦенахПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьНачальныеДанныеОПорядкеОбеспечения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОХарактеристиках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПланахПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеЛистовУчетаИзSQL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОПоставщиках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОСпецификациях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеПоБонусамНаРаскрутку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОГрафикахПоставкиТовара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеОТоварномАссортименте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗагрузкаДанныхИзAccess/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РедактироватьПериод(Команда)
	
	СтандартныйПериод = Новый СтандартныйПериод(Объект.ДатаНачала, Объект.ДатаОкончания);
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогРедактирования.Период = СтандартныйПериод;
	Если ДиалогРедактирования.Редактировать() Тогда
		СтандартныйПериод = ДиалогРедактирования.Период;
		Объект.ДатаНачала = СтандартныйПериод.ДатаНачала;
		Объект.ДатаОкончания = СтандартныйПериод.ДатаОкончания;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗагрузитьДанныеЛистовУчета(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеЛистовУчета(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеЛистовУчетаИзSQL()
	
	//Обработки.ЗагрузкаДанныхИзAccess.ЗагрузкаДанныхЛистовУчета_СКЛ_ПоДатеЗагрузки();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПромоакциях(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПромоакциях(ДатаОбработки);	
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПоступлениях(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПоступлениях(ДатаОбработки);	
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПеремещениях(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПеремещениях(ДатаОбработки);		
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОБланках(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОБланках(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОЗаказахПоставщику(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОЗаказахПоставщику(ДатаОбработки);	
	
КонецПроцедуры

Процедура ЗагрузитьДанныеТорговыхТочек()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеТорговыхТочек();	
	
КонецПроцедуры	

Процедура ЗагрузитьДанныеОГруппахТорговыхТочек()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОГруппахТорговыхТочек();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОСкладах()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОСкладах();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОНоменклатуре()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОНоменклатуре();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПоставщиках()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПоставщиках();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОСпецификациях(ДатаЗаписи)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОСпецификациях(ДатаЗаписи);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОХарактеристиках()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОХарактеристиках();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОБонусахНаРаскруткуТТ()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОБонусахНаРаскруткуТТ();	
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПродавцах()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПродавцах();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОКладовщиках()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОКладовщиках();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОЗаказеИПоставкеПродукции()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОЗаказеИПоставкеПродукции();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОУсловияхПоставкиТовара()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОУсловияхПоставкиТовара();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОТоварныхОграниченияхНаТТ()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОТоварныхОграниченияхНаТТ();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПараметрахНоменклатурыДляЗаказа()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПараметрахНоменклатурыДляЗаказа();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОГрафикеРазвозаТовараНаТТ()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОГрафикеРазвозаТовараНаТТ();
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОбОрганизацииПолучателеТовараНаТТ()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОбОрганизацииПолучателеТовараНаТТ();
	
КонецПроцедуры

Процедура ЗагрузитьНачальныеДанныеОЦенахПоставщика(ДатаНачало)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОНачальныхЦенахЗакупки(ДатаНачало);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОЦенахПоставщика(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОЦенахЗакупки(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПланахПродаж(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПланахПродаж(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеРазмещенияРекламы()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеРазмещенияРекламы();
	
КонецПроцедуры	

Процедура ЗагрузитьДанныеОКоличествеПродавцовНаТорговыхТочках()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОКоличествеПродавцовНаТорговыхТочках();
	
КонецПроцедуры	

Процедура ЗагрузитьДанныеОТоварномАссортименте()
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОТоварномАссортиментеНаТорговыхТочках(ТекущаяДата());
	
КонецПроцедуры	

Процедура ЗагрузитьДанныеОМаржинальностиТорговыхТочек(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОМаржинальностиТорговыхТочек(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОбОбученииПродавцов(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОбОбученииПродавцов(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПотерянныхПродажах(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОбОбученииПродавцов(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОЦенахПродаж(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОЦенахПродаж(ДатаОбработки);	
	
КонецПроцедуры

Процедура ЗагрузитьНачальныеДанныеОПорядкеОбеспечения(ДатаНачало)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьНачальныеДанныеОПорядкеОбеспеченияТорговыхТочек(ДатаНачало);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОПорядкеОбеспеченияТорговыхТочек(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОПорядкеОбеспеченияТорговыхТочек(ДатаОбработки);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОбращенийКПокупателям(ДатаОбработки)
	
	Обработки.ЗагрузкаДанныхИзAccess.ЗагрузитьДанныеОбращенийКПокупателям(ДатаОбработки);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Если Объект.ЗагружатьДанныеОГруппахТорговыхТочек Тогда
		Состояние("Идет обработка данных о группах торговых точек ...");
		ЗагрузитьДанныеОГруппахТорговыхТочек();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОТорговыхТочках Тогда
		Состояние("Идет обработка данных о торговых точках ...");
		ЗагрузитьДанныеТорговыхТочек();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОСкладах Тогда
		Состояние("Идет обработка данных о складах ...");
		ЗагрузитьДанныеОСкладах();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОНоменклатуре Тогда
		Состояние("Идет обработка данных о номенклатуре ...");
		ЗагрузитьДанныеОНоменклатуре();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОСпецификациях Тогда
		Состояние("Идет обработка данных о спецификациях ...");
		ЗагрузитьДанныеОСпецификациях(Объект.ДатаНачала);
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОПоставщиках Тогда
		Состояние("Идет обработка данных о поставщиках ...");
		ЗагрузитьДанныеОПоставщиках();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОХарактеристиках Тогда
		Состояние("Идет обработка данных о характеристиках ...");
		ЗагрузитьДанныеОХарактеристиках();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеПоБонусамНаРаскрутку Тогда
		Состояние("Идет обработка данных о бонусах на раскрутку ТТ ...");
		ЗагрузитьДанныеОБонусахНаРаскруткуТТ();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	
	Если Объект.ЗагружатьДанныеОПродавцах Тогда
		Состояние("Идет обработка данных о продавцах ...");
		ЗагрузитьДанныеОПродавцах();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОПривязкеКладовщиковКСкладам Тогда
		Состояние("Идет обработка данных о привязке кладовщиков ...");
		ЗагрузитьДанныеОКладовщиках();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОПривязкеКладовщиковКСкладам Тогда
		Состояние("Идет обработка данных о привязке кладовщиков ...");
		ЗагрузитьДанныеОКладовщиках();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОЗаказеИПоставкеТовара Тогда
		Состояние("Идет обработка данных о заказе и поставке товаров ...");
		ЗагрузитьДанныеОЗаказеИПоставкеПродукции();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОбУсловияхПоставкиТовара Тогда
		Состояние("Идет обработка данных об условиях поставки товара ...");
		ЗагрузитьДанныеОУсловияхПоставкиТовара();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОбУсловияхПоставкиТовара Тогда
		Состояние("Идет обработка данных о параметрах номенклатуры для заказа ...");
		ЗагрузитьДанныеОПараметрахНоменклатурыДляЗаказа();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОТоварныхОграниченияхНаТорговыхТочках Тогда
		Состояние("Идет обработка данных о товарных ограничениях на ТТ ...");
		ЗагрузитьДанныеОТоварныхОграниченияхНаТТ();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОГрафикеРазвозаТовараПоТочкам Тогда
		Состояние("Идет обработка данных о графике развоза товара на ТТ ...");
		ЗагрузитьДанныеОГрафикеРазвозаТовараНаТТ();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОбОрганизацииПолучателеТовараНаТочку Тогда
		Состояние("Идет обработка данных об организации-получателе товара от поставщика ...");
		ЗагрузитьДанныеОбОрганизацииПолучателеТовараНаТТ();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьНачальныеДанныеОЦенахПоставщиков Тогда
		Состояние("Идет обработка начальных данных о ценах поставщика ...");
		ЗагрузитьНачальныеДанныеОЦенахПоставщика(Объект.ДатаНачала - 86400);
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьНачальныеДанныеОПорядкеОбеспечения Тогда
		Состояние("Идет обработка начальных данных о порядке обеспечения ...");
		ЗагрузитьНачальныеДанныеОПорядкеОбеспечения(Объект.ДатаНачала - 86400);
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеЛистовУчетаИзSQL Тогда
		Состояние("Идет обработка данных листов учета ...");
		ЗагрузитьДанныеЛистовУчетаИзSQL();
	КонецЕсли;
	ОбработкаПрерыванияПользователя();
	
	МассивОбработанныеМесяцы_МаржТочки = Новый Массив();
	ДатаОбработки = Объект.ДатаНачала;
	Пока ДатаОбработки <= Объект.ДатаОкончания Цикл
		Если Объект.ЗагружатьДанныеЛистовУчета Тогда
			Состояние("Идет обработка данных листов учета за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеЛистовУчета(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОбращенийКПокупателям Тогда
			Состояние("Идет обработка данных обращений к покупателям за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОбращенийКПокупателям(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОПромоакциях Тогда
			Состояние("Идет обработка данных о промоакциях за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОПромоакциях(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеПоступлений Тогда
			Состояние("Идет обработка данных о поступлениях за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОПоступлениях(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеПеремещений Тогда
			Состояние("Идет обработка данных о перемещениях за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОПеремещениях(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеБланков Тогда
			Состояние("Идет обработка данных о бланках за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОБланках(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОЗаказахПоставщику Тогда
			Состояние("Идет обработка данных о заказах поставщику за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОЗаказахПоставщику(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОМаржинальностиТорговыхТочек Тогда
			Состояние("Идет обработка данных о маржинальности торговых точек за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			Если МассивОбработанныеМесяцы_МаржТочки.Найти(НачалоМесяца(ДатаОбработки)) = Неопределено Тогда
				ЗагрузитьДанныеОМаржинальностиТорговыхТочек(ДатаОбработки);
				МассивОбработанныеМесяцы_МаржТочки.Добавить(НачалоМесяца(ДатаОбработки));
			КонецЕсли;	
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОбОбученииПродавцов Тогда
			Состояние("Идет обработка данных об обучении продавцов за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОбОбученииПродавцов(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОПотерянныхПродажах Тогда
			Состояние("Идет обработка данных о потерянных продажах за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОПотерянныхПродажах(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОЦенахПродажиНоменклатуры Тогда
			Состояние("Идет обработка данных о ценах продажи номенклатуры за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОЦенахПродаж(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОПорядкеОбеспеченияТорговыхТочек Тогда
			Состояние("Идет обработка данных о порядке обеспечения торговых точек за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОПорядкеОбеспеченияТорговыхТочек(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОЦенахПоставщиков Тогда
			Состояние("Идет обработка данных о ценах поставщика за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОЦенахПоставщика(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		Если Объект.ЗагружатьДанныеОПланахПродаж Тогда
			Состояние("Идет обработка данных о планах продаж за " + Формат(ДатаОбработки, "ДФ=dd.MM.yyyy") + " ...");
			ЗагрузитьДанныеОПланахПродаж(ДатаОбработки);
		КонецЕсли;
		ОбработкаПрерыванияПользователя();
		ДатаОбработки = ДатаОбработки + 86400;
	КонецЦикла;
	
	Если Объект.ЗагружатьСведенияОРазмещеннойРекламе Тогда
		Состояние("Идет обработка данных о размещенной рекламе ...");
		ЗагрузитьДанныеРазмещенияРекламы();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();
	
	Если Объект.ЗагружатьДанныеОКоличествеПродавцовНаТочках Тогда
		Состояние("Идет обработка данных о количестве продавцов на торговых точках ...");
		ЗагрузитьДанныеОКоличествеПродавцовНаТорговыхТочках();
	КонецЕсли;	
	
	Если Объект.ЗагружатьДанныеОТоварномАссортименте Тогда
		Состояние("Идет обработка данных о товарном ассортименте торговых точек ...");
		ЗагрузитьДанныеОТоварномАссортименте();
	КонецЕсли;
	
	ОбработкаПрерыванияПользователя();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаНачала = ТекущаяДата();
	Объект.ДатаОкончания = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажки(Признак = Истина)
	
	Объект.ЗагружатьСведенияОРазмещеннойРекламе = Признак;
	Объект.ЗагружатьДанныеЛистовУчета = Признак;
	Объект.ЗагружатьДанныеОКоличествеПродавцовНаТочках = Признак;
	Объект.ЗагружатьДанныеОТорговыхТочках = Признак;
	Объект.ЗагружатьДанныеОНоменклатуре = Признак;
	Объект.ЗагружатьДанныеОСкладах = Признак;
	Объект.ЗагружатьДанныеОГруппахТорговыхТочек = Признак;
	Объект.ЗагружатьДанныеОбращенийКПокупателям = Признак;
	Объект.ЗагружатьДанныеОМаржинальностиТорговыхТочек = Признак;
	Объект.ЗагружатьДанныеОПромоакциях = Признак;
	Объект.ЗагружатьДанныеОбОбученииПродавцов = Признак;
	Объект.ЗагружатьДанныеОПродавцах = Признак;
	Объект.ЗагружатьДанныеОПотерянныхПродажах = Признак;
	Объект.ЗагружатьДанныеПоступлений = Признак;
	Объект.ЗагружатьДанныеПеремещений = Признак;
	Объект.ЗагружатьДанныеОПривязкеКладовщиковКСкладам = Признак;
	Объект.ЗагружатьДанныеОЦенахПродажиНоменклатуры = Признак;
	Объект.ЗагружатьДанныеБланков = Признак;
	Объект.ЗагружатьДанныеОПорядкеОбеспеченияТорговыхТочек = Признак;
	Объект.ЗагружатьДанныеОЗаказеИПоставкеТовара = Признак;
	Объект.ЗагружатьДанныеОбУсловияхПоставкиТовара = Признак;
	Объект.ЗагружатьДанныеОЗаказахПоставщику = Признак;
	Объект.ЗагружатьДанныеОПараметрахЗагрузкиНоменклатуры = Признак;
	Объект.ЗагружатьДанныеОТоварныхОграниченияхНаТорговыхТочках = Признак;
	Объект.ЗагружатьДанныеОГрафикеРазвозаТовараПоТочкам = Признак;
	Объект.ЗагружатьНачальныеДанныеОЦенахПоставщиков = Признак;
	Объект.ЗагружатьДанныеОЦенахПоставщиков = Признак;
	Объект.ЗагружатьНачальныеДанныеОПорядкеОбеспечения = Признак;
	Объект.ЗагружатьДанныеОХарактеристиках = Признак;
	Объект.ЗагружатьДанныеПоБонусамНаРаскрутку = Признак;
	Объект.ЗагружатьДанныеОПланахПродаж = Признак;
	Объект.ЗагружатьДанныеОбОрганизацииПолучателеТовараНаТочку = Признак;
	Объект.ЗагружатьДанныеЛистовУчетаИзSQL = Признак;
	Объект.ЗагружатьДанныеОПоставщиках = Признак;
	Объект.ЗагружатьДанныеОСпецификациях = Признак;
	Объект.ЗагружатьДанныеОТоварномАссортименте = Признак;
	
КонецПроцедуры	

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	
	ОбработатьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	
	ОбработатьФлажки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбработатьФлажки();
	
КонецПроцедуры
